# SQL Cheat Sheet : AS Aliasing

___

## 0. Loading Database

In [1]:
%reload_ext sql

In [2]:
%%sql
postgresql://localhost/films

'Connected: @films'

In [12]:
%%sql
SELECT * FROM films LIMIT 2;

 * postgresql://localhost/films
2 rows affected.

[(1, "Intolerance: Love's Struggle Throughout the Ages", 1916, 'USA', 123, None, 'Not Rated', None, 385907),
 (2, 'Over the Hill to the Poorhouse', 1920, 'USA', 110, None, None, 3000000, 100000)]

___

## 1. AS Aliasing

In [4]:
%%sql
SELECT MAX(budget), MAX(duration)
FROM films;

 * postgresql://localhost/films
1 rows affected.

[(12215500000, 334)]

- #### The above query gives 2 columns with names that dont tell us much about the content
- #### To avoid situations like this, SQL allows you to do something called aliasing

In [5]:
%%sql
SELECT MAX(budget) AS max_budget,
       MAX(duration) AS max_duration
FROM films;

 * postgresql://localhost/films
1 rows affected.

[(12215500000, 334)]

In [13]:
%%sql
--  title and net profit (the amount a film grossed, minus its budget) for all films. 
SELECT title, 
       gross - budget AS net_profit
FROM films 
LIMIT 5;

 * postgresql://localhost/films
5 rows affected.

[("Intolerance: Love's Struggle Throughout the Ages", None),
 ('Over the Hill to the Poorhouse', 2900000),
 ('The Big Parade', None),
 ('Metropolis', -5973565),
 ("Pandora's Box", None)]

In [7]:
%%sql
--  title and duration in hours for all films
SELECT title, 
       duration / 60.0 AS duration_hours
FROM films 
LIMIT 5;

 * postgresql://localhost/films
5 rows affected.

[("Intolerance: Love's Struggle Throughout the Ages", Decimal('2.0500000000000000')),
 ('Over the Hill to the Poorhouse', Decimal('1.8333333333333333')),
 ('The Big Parade', Decimal('2.5166666666666667')),
 ('Metropolis', Decimal('2.4166666666666667')),
 ("Pandora's Box", Decimal('1.8333333333333333'))]

In [8]:
%%sql
--the average duration in hours for all films
SELECT AVG(duration)/60.0 AS avg_duration_hours
FROM films;

 * postgresql://localhost/films
1 rows affected.

[(Decimal('1.7991321897073663'),)]

___

## 2. More Aliasing

In [9]:
%%sql
-- percentage of people who are no longer alive. 
SELECT COUNT(deathdate) * 100.0 / count(*) AS percentage_dead
FROM people;

 * postgresql://localhost/films
1 rows affected.

[(Decimal('9.3723949029415267'),)]

In [10]:
%%sql
--- number of years between the newest film and oldest film. 
SELECT MAX(release_year) - MIN(release_year) AS difference
FROM films;

 * postgresql://localhost/films
1 rows affected.

[(100,)]

In [11]:
%%sql
-- number of decades the films table covers
SELECT (MAX(release_year) - MIN(release_year)) / 10.0 AS no_of_decades
FROM films;

 * postgresql://localhost/films
1 rows affected.

[(Decimal('10.0000000000000000'),)]